# GetDeformedShapeSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..GetDeformedShapeSettings Method
AnalysisDisplayStyle Class See Also
---
Get deformed shape settings object from the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public AnalysisDisplayDeformedShapeSettings GetDeformedShapeSettings()
```

Visual Basic
---
```text
Public Function GetDeformedShapeSettings As AnalysisDisplayDeformedShapeSettings
```

Visual C++
---
```text
public:
AnalysisDisplayDeformedShapeSettings^ GetDeformedShapeSettings()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | deformed shape settings were not created with the object. |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace